<?php
/*********************************************************
 * 渠道对应支付宝显示列表
 * 
 * @author  Lujia
 * @version 1.0 by Lujia @ 2014.3.19 创建
 ***********************************************************/
 
$_channel_display = array(
		'Ch1999' 	=> array(1, '2.5.1', ''),			// 移动游戏基地强联网官方包
		'Ch2000' 	=> array(0, '2.0.0', 'http://42.62.67.243/download/sheep_14_02_21_test_update.apk'),		// 移动游戏基地官方渠道
		'Ch2001' 	=> array(0, '2.5.1', 'http://shouji.360tpcdn.com/140327/3e23c2eb90e180f67ad21efcf05bca1d/com.unitygames.sheephappens_27.apk'),		// 360平台
		'Ch2002' 	=> array(1, '2.0.0', 'http://42.62.67.243/download/sheep_14_02_21_test_update.apk'),		// 亚马逊Kindle版本
		'Ch2003' 	=> array(1, '2.0.0', ''),			// 联通沃商店
		'Ch2004' 	=> array(0, '2.0.0', ''),			// 百度多酷
		'Ch2005' 	=> array(1, '2.0.0', ''),			// 91无线
		'Ch2006' 	=> array(0, '2.0.0', ''),			// UC九游
		'Ch2007' 	=> array(0, '2.0.0', ''),			// 当乐
		'Ch2008' 	=> array(0, '2.0.0', ''),			// 三星
		'Ch2009' 	=> array(1, '2.0.0', ''),			// 小米
		'Ch2010'	=> array(0, '2.0.0', ''),			// Oppo渠道
		'Ch2011'	=> array(1, '2.0.0', ''),			// 机锋网
		'Ch2012'	=> array(0, '2.0.0', ''),			// 金山网络
		'Ch2013'	=> array(1, '2.5.1', ''),			// 豌豆荚
		'Ch2014'	=> array(1, '2.5.1', ''),			// 应用汇
		'Ch2015'	=> array(1, '2.5.1', ''),			// 搜狗大厅
		'Ch2016'	=> array(1, '2.5.1', ''),			// 搜狗浏览器
		'Ch2017'	=> array(1, '2.5.1', ''),			// 搜狗市场
		'Ch2018'	=> array(1, '2.5.1', ''),			// 搜狗输入法
		'Ch2019'	=> array(1, '2.5.1', ''),			// 搜狗搜索
		'Ch2020'	=> array(1, '2.5.1', ''),			// 搜狗助手
		'Ch2021'	=> array(1, '2.5.1', ''),			// 3G门户
		'Ch2022'	=> array(0, '2.5.1', ''),			// 优亿渠道
		
		'Ch9999'	=> array(0, '2.0.0', '')			// 推广渠道
		
);

// return $ErrorCode;